app/views/comments/_comment.html.erb

      <div class="comment-name">
        <%=comment.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]