app/controllers/blogs_controller.rb

  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)
---
SELECT  "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def show
    if logged_in?(:site_admin) || @blog.published?
   @blog = Blog.includes(:comments).friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 5

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hello"], ["body", "a"], ["created_at", "2017-06-21 14:32:40.932896"], ["updated_at", "2017-06-21 14:32:40.932896"], ["slug", "hello"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["body", "yo yo yo yo"], ["updated_at", "2017-06-14 15:52:13.365179"], ["id", 5]]