app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios" ORDER BY position ASC
---
  def index
    @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "item"], ["body", "item"], ["created_at", "2017-06-15 16:31:30.997839"], ["updated_at", "2017-06-15 16:31:30.997839"]]
---
  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "portfolios" SET "main_image" = $1, "thumb_image" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["main_image", "ABJ.PNG"], ["thumb_image", "jackavatar.jpg"], ["updated_at", "2017-07-27 16:41:37.396030"], ["id", 15]]
---
 def update

   @portfolio_item = Portfolio.find(params[:id])

    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
def show
  @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 4]]
---
  def destroy
     @portfolio_item = Portfolio.find(params[:id])
    @portfolio_item.destroy