app/controllers/portfolios_controller.rb

  def sort
  params[:order].each do |key, value|
    Portfolio.find(value[:id]).update(position: value[:position])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "portfolios" SET "position" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["position", 2], ["updated_at", "2017-07-26 14:37:42.591270"], ["id", 7]]